# Contents

> Importing libraries and data

> Check for mixed type columns

> Check for missing values

> Check for dupes

> Run describe

> Export checked data

# Importing libraries

In [11]:
#import libraries
import pandas as pd
import numpy as np
import os

# Importing data

In [12]:
path = r'/Users/vanessalimsingh/Instacart Basket Analysis 07-05-2024'

In [13]:
df_prods=pd.read_csv(os.path.join(path, '02 Data' , 'Original Data', 'products.csv'), index_col=False)

In [58]:
df_ordswrangled=pd.read_csv(os.path.join(path, '02 Data' , 'Prepared Data', 'orders_wrangled.csv'), index_col=False)

In [15]:
df_ords=df_ordswrangled

In [59]:
df_ords.shape

(3421083, 9)

In [17]:
df_ords.columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'order_id', 'user_id', 'eval_set',
       'order_number', 'order_dow', 'order_hour_of_day',
       'days_since_prior_order'],
      dtype='object')

In [18]:
df_ords.head(5)

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,prior,1,2,8,NaN
1,1,1,2398795,1,prior,2,3,7,15.0
2,2,2,473747,1,prior,3,3,12,21.0
3,3,3,2254736,1,prior,4,4,7,29.0
4,4,4,431534,1,prior,5,4,15,28.0

In [19]:
#Creating a new dataframe

In [20]:
df_test = pd.DataFrame()

In [21]:
#create a mixed type column

In [22]:
df_test['mix']=['a','b',1,True]

In [23]:
df_test.head

<bound method NDFrame.head of     mix
0     a
1     b
2     1
3  True>

In [24]:
#check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

/var/folders/1g/ch7w9_k56pj78tjf9gzlt8zm0000gn/T/ipykernel_60887/353457738.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [25]:
#check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [26]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

# finding missing values

In [27]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [28]:
df_nan=df_prods[df_prods['product_name'].isnull()==True]
print(df_nan)

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [29]:
df_prods.shape

(49693, 5)

In [30]:
df_prods[df_prods['product_name'].isnull() == False]

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [31]:
df_prods_clean=df_prods[df_prods['product_name'].isnull() == False]

In [32]:
df_prods_clean.shape

(49677, 5)

In [33]:
df_prods.shape

(49693, 5)

# finding dupes

In [34]:
df_prods_clean[df_prods_clean.duplicated()]

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [35]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [36]:
# current number of rows in  df_prods_clean

In [37]:
df_prods_clean.shape

(49677, 5)

In [38]:
df_dups.shape

(5, 5)

In [39]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [40]:
df_prods_clean_no_dups.shape

(49672, 5)

In [41]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [42]:
############

# Task begins

# Step 2: Run describe

In [43]:
#run describe on df_ords
df_ords.describe()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [44]:
#limit to 3 decimals
df_ords.describe().round(3)

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3421083.00,3421083.00,3421083.00,3421083.000,3421083.000,3421083.000,3421083.000,3214874.000
mean,1710541.00,1710541.00,1710542.00,102978.208,17.155,2.776,13.452,11.115
std,987581.74,987581.74,987581.74,59533.718,17.733,2.047,4.226,9.207
min,0.00,0.00,1.00,1.000,1.000,0.000,0.000,0.000
25%,855270.50,855270.50,855271.50,51394.000,5.000,1.000,10.000,4.000
50%,1710541.00,1710541.00,1710542.00,102689.000,11.000,3.000,13.000,7.000
75%,2565811.50,2565811.50,2565812.50,154385.000,23.000,5.000,16.000,15.000
max,3421082.00,3421082.00,3421083.00,206209.000,100.000,6.000,23.000,30.000

In [45]:
df_ords.head(5)

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,prior,1,2,8,NaN
1,1,1,2398795,1,prior,2,3,7,15.0
2,2,2,473747,1,prior,3,3,12,21.0
3,3,3,2254736,1,prior,4,4,7,29.0
4,4,4,431534,1,prior,5,4,15,28.0

In [46]:
df_ords.columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'order_id', 'user_id', 'eval_set',
       'order_number', 'order_dow', 'order_hour_of_day',
       'days_since_prior_order'],
      dtype='object')

In [47]:
#limit to 3 decimals
df_ords.describe().round(3)

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3421083.00,3421083.00,3421083.00,3421083.000,3421083.000,3421083.000,3421083.000,3214874.000
mean,1710541.00,1710541.00,1710542.00,102978.208,17.155,2.776,13.452,11.115
std,987581.74,987581.74,987581.74,59533.718,17.733,2.047,4.226,9.207
min,0.00,0.00,1.00,1.000,1.000,0.000,0.000,0.000
25%,855270.50,855270.50,855271.50,51394.000,5.000,1.000,10.000,4.000
50%,1710541.00,1710541.00,1710542.00,102689.000,11.000,3.000,13.000,7.000
75%,2565811.50,2565811.50,2565812.50,154385.000,23.000,5.000,16.000,15.000
max,3421082.00,3421082.00,3421083.00,206209.000,100.000,6.000,23.000,30.000

# Obsevations and clarifications
>What is the 'unnamed' column?
>The count of rows is consistent for all columns aside from 'days_since_prior_order'
>Clarify days of week. Does 0 represent Monday and 6 represent Sunday?
>The max order_number is 100. Does this column refer to number of items ordered and is the max 100?
>Order hour of the day ranges from 0:00 to 23:00. This looks accurate.
>What does 0 days since prior order mean - is this a new customer? And is there a reason the maximum value is 30?

# Step 3: Check for mixed-type data

In [48]:
#updated to .map due to jupyter warning
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [49]:
for col in df_ords.columns.tolist():
    weird = (df_ords[col].map(type) != df_ords[col].iloc[0].__class__).any()
    if weird:
        print(col)

Unnamed: 0.1
Unnamed: 0
order_id
user_id
order_number
order_dow
order_hour_of_day
days_since_prior_order

In [50]:
df_ords.dtypes

Unnamed: 0.1                int64
Unnamed: 0                  int64
order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

# Step 4

# We need to clarify why every column has been listed as mixed

>If the data listed are accurate, and the mixed columns should be updated,
we can use  df_ords['column_name'] = df_ords['column_name'].astype('int64')

# Step 5

In [51]:
#Missing values check

In [52]:
df_ords.isnull().sum()

Unnamed: 0.1                   0
Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

# 206,209 missing values for days_since_prior_order

In [53]:
df_ords[df_ords['days_since_prior_order'].isnull()==True]

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,prior,1,2,8,NaN
11,11,11,2168274,2,prior,1,2,11,NaN
26,26,26,1374495,3,prior,1,1,14,NaN
39,39,39,3343014,4,prior,1,6,11,NaN
45,45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...,...
3420930,3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3421069,3154581,206209,prior,1,3,11,NaN

# Step 6: address missing values

In [54]:
df_ords_missingrows=df_ords[df_ords['days_since_prior_order'].isnull()==True]

# A new dataset with all missing rows was created 'df_ords_missingrows'
> These rows should not be removed as it is an incredibly high number or rows, and 
all other data points within those rows are filled, and we do not want to lose that data.

# Step 7: Run a check for duplicate values

In [55]:
df_ords[df_ords.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0.1, Unnamed: 0, order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

# No duplicate values were found.

# Step 8: Addressing duplicates

> No duplicate values were found. If dupes are found, I would:
> 1.count the number of rows in data set using df_ords.shape
> 2.Delete dupes using df_ords.drop_duplicates() and create new data frame.
> 3.Run another check on number of rows to make sure it corresponds.

# Exporting data

In [56]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [57]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [65]:
df_prods_clean_no_dups.shape

(49672, 5)